#include "ui.h"

int main() {
    runUI();
    return 0;
/*
additions 1:
Большое кол-во тестов
    1 Вывод через пробелы(обещают арность не больше 3)
    2 subtree research листья смотрим 
    3 халявщик - erase (хотим сохранить детей)
    (удаляем и оставялем самый левый элемент (смотреть на планшете))
additions 2:
    4 X вместо nullptr (выводить)
    5 хочу генерировать случайное дерево (по заданным: высота, процентная заполненность уровня (округлить до ближайшего целого))
    6 найти путь для элемента по введенному значению И уровню (пусть выведет все значения)
    7 БАК (можно добавить узел к нулевому указателю)
    8 ТЕСТЫ НУЖНЫ ХОРОШИЕ (СЕЙЧАС ПЛОХИЕ)
*/
}